#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<math.h>



////5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果
////A选手说：B第二，我第三；
////B选手说：我第二，E第四；
////C选手说：我第一，D第二；
////D选手说：C最后，我第三；
////E选手说：我第四，A第一；
////比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	int e = 0;
//	for (a = 1;a < 6;a++)
//	{
//		for (b = 1;b < 6;b++)
//		{
//			for (c = 1;c < 6;c++)
//			{
//				for (d = 1;d < 6;d++)
//				{
//					for (e = 1;e < 6;e++)
//					{
//						if (a * b * c * d * e == 120)
//						{
//							if ((b == 2) + (a == 3) == 1 &&
//								(b == 2) + (e == 4) == 1 &&
//								(c == 1) + (d == 2) == 1 &&
//								(c == 5) + (d == 3) == 1 &&
//								(e == 4) + (a == 1) == 1)
//							{
//								printf("A=%d,B=%d,C=%d,D=%d,E=%d\n", a, b, c, d, e);
//							}
//						}
//					}
//				}
//			}
//		}
//	}
//	return 0;
//}



////日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个
////嫌疑犯的一个。以下为4个嫌疑犯的供词。
////A说：不是我。
////B说：是C。
////C说：是D。
////D说：C在胡说
////已知3个人说了真话，1个人说的是假话。
////现在请根据这些信息，写一个程序来确定到底谁是凶手。
//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	for (a = 0;a < 2;a++)
//	{
//		for (b = 0;b < 2;b++)
//		{
//			for (c = 0;c < 2;c++)
//			{
//				for (d = 0;d < 2;d++)
//				{
//					if (a + b + c + d == 1)
//					{
//						if ((a != 1) + (c == 1) + (d == 1) + (d != 1) == 3)
//						{
//							if (a == 1)
//								printf("a\n");
//							if (b == 1)
//								printf("b\n");
//							if (c == 1);
//							    printf("c\n");
//							if (d == 1)
//								printf("d\n");
//						}
//					}
//
//				}
//			}
//		}
//	}
//	return 0;
//}


////3.在屏幕上打印杨辉三角。
////1
////1 1
////1 2 1
////1 3 3 1
//int main()
//{
//	int arr[4][4] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0;i < 4;i++)
//	{
//		for (j = 0;j <= i;j++)
//		{
//			arr[i][0] = 1;
//			if ((j != 0) && (i != j))
//			{
//				arr[i][j] = arr[i - 1][j] + arr[i - 1][j - 1];
//			}
//			if (i == j)
//			{
//				arr[i][j] = 1;
//			}
//			printf(" %d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}


////编写函数：
////unsigned int reverse_bit(unsigned int value);
////这个函数的返回值是value的二进制位模式从左到右翻转后的值。
////
////如：
////在32位机器上25这个值包含下列各位：
////00000000000000000000000000011001
////翻转后：（2550136832）
////10011000000000000000000000000000
////程序结果返回：
////2550136832
//unsigned int reverse_bit(unsigned int value)
//{
//	int i = 1;
//	int arr[32] = { 0 };
//	int sum = 0;
//	for (i = 0;i < 32;i++)
//	{
//		arr[i] = (value>>i) & 1;
//	}
//	for (i = 0;i < 32;i++)
//	{
//		printf("%d ",arr[i]);
//	}
//	printf("\n");
//	for (i = 0;i<32 ;i++)
//	{
//		sum += arr[i] * pow(2, 31 - i);
//	}
//	return sum;
//}
//int main()
//{
//	unsigned int a = 25;
//	unsigned int b = 0;
//	printf("翻转后的二进制为：");
//    b = reverse_bit(a);
//	printf("%u", b);
//	return 0;
//}


////2.不使用（a + b） / 2这种方式，求两个数的平均值。
//int main()
//{
//	int a = 0;
//	int b = 0;
//	scanf("%d%d", &a, &b);
//	printf("%d", (a & b) + ((a ^ b) >> 1)); //a&b 为a和b二进制相同的地方；  a^b为a和b二进制不同的地方 ；(a^b)>>1为不同的部分除以2 ；合之即为平局数；
//	return 0;
//}



////3.编程实现：
////一组数据中只有一个数字出现了一次。其他所有数字都是成对出现的。
////请找出这个数字。（使用位运算）
//int main()
//{
//	int arr[] = { 1,2,3,4,5,6,1,2,3,4,5 };
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	int a = 0;
//	int i = 0;
//	for (i = 0;i < sz;i++)
//	{
//		a ^= arr[i];
//	}
//	printf("%d", a);
//	return 0;
//}

}